Revit 2026 API

# DesignToFabricationConverter Class

---

This class represents the MEP design to fabrication part convert tool.

SystemObject Autodesk.Revit.DB.FabricationDesignToFabricationConverter

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DesignToFabricationConverter : IDisposable
```
```vb
Public Class DesignToFabricationConverter
	Implements IDisposable
```
```cpp
public ref class DesignToFabricationConverter : IDisposable
```
```fsharp
type DesignToFabricationConverter =
    class
        interface IDisposable
    end
```

The DesignToFabricationConverter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DesignToFabricationConverter | Creates a new instance of the DesignToFabricationConverter class. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Convert |  |
|  | Dispose | Releases all resources used by the DesignToFabricationConverter |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetConvertedFabricationParts | Gets the set of element identifiers for newly created fabrication parts. |
|  | GetConvertedFabricationPartsWithInvalidConnections | Gets the collection of converted fabrication parts with invalid connections. |
|  | GetDesignElementAndFabricationPartsWithDifferentOffsets | Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets. |
|  | GetDesignElementAndFabricationPartsWithOpenConnectors | Gets the collection of design elements that failed to convert and the associated set of fabrication parts with open connectors. |
|  | GetElementsWithOpenConnector | Gets the set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPartialConvertFailureResults | Gets the partial failure results. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetMapForFamilySymbolToFabricationPartType |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

After a new instance of the class is created, call the **Convert** method to convert the MEP design elements into fabrication parts. Use the method **SetMapForFamilySymbolToFabricationPartType** to optionally convert family content to fabrication parts prior to calling **Convert** by providing a mapping of family symbols to fabrication parts types. If not set, then during conversion these families will remain and any connections to other converted elements will be maintained. After the convert method has been invoked, query the class to obtain more information about the conversion:

  * GetConvertedFabricationParts to get a set of element identifiers for the newly created fabrication parts.
  * GetElementsWithOpenConnector to get a set of fabrication part or MEP design element identifiers with open connectors, caused by fittings failing to convert.

#### Reference

Autodesk.Revit.DB.Fabrication Namespace